# RenderNode Properties

---
The RenderNode type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| NodeName|  A readable name of the output node.
Top
#### Reference
RenderNode Class
Autodesk.Revit.DB Namespace